Австралия/src/Documents/ManufacturingOverheadsRates/ManufacturingOverheadsRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ManufacturingOverheadsRates</name>
  <registerRecords>InformationRegister.PredeterminedOverheadRates</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rates</name>
    <attributes>
      <name>Activity</name>
      <type>
        <types>CatalogRef.ManufacturingActivities</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>CostDriver</name>
      <type>
        <types>CatalogRef.CostDrivers</types>
      </type>
    </attributes>
    <attributes>
      <name>GLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ManufacturingOverheadsAllocationMethods/ManufacturingOverheadsAllocationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ManufacturingOverheadsAllocationMethods</name>
  <enumValues>
    <name>PlantwideAllocation</name>
  </enumValues>
  <enumValues>
    <name>DepartmentalAllocation</name>
  </enumValues>
  <enumValues>
    <name>ActivityBasedCosting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/ManufacturingOverheadsRates/Forms/DocumentForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DriveServer.FillDocumentHeader(
		Object,
		,
		Parameters.CopyingValue,
		Parameters.Basis,
		PostingIsAllowed,
		Parameters.FillingValues);
	
	If Not ValueIsFilled(DocumentDate) Then
		DocumentDate = CurrentSessionDate();
	EndIf;
	
	ParentCompany = DriveServer.GetCompany(Object.Company);
	
	SetAccountingPolicyValues();
	SetVisibleAndEnable();
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.ObjectVersioning
	ObjectsVersioning.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.ObjectVersioning
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	DocumentDate = CurrentObject.Date;
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
	// End StandardSubsystems.AttachableCommands
	
	// StandardSubsystems.EditProhibitionDates
	PeriodClosingDates.ObjectOnReadAtServer(ThisObject, CurrentObject);
	// End StandardSubsystems.EditProhibitionDates
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure CompanyOnChange(Item)
	
	SetAccountingPolicyValues();
	
	SetVisibleAndEnable();
	
EndProcedure

&AtClient
Procedure DateOnChange(Item)
	
	DriveClient.ProcessDateChange(ThisObject);
	
EndProcedure

&AtClient
Procedure CommentStartChoice(Item, ChoiceData, StandardProcessing)
	
	CommonClient.ShowCommentEditingForm(Item.EditText, ThisObject);
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlers

&AtClient
Procedure RatesGLAccountOnChange(Item)
	
	CurData = Items.Rates.CurrentData;
	If CurData <> Undefined Then
		
		StructureData = New Structure("
		|TabName,
		|Object,
		|GLAccount,
		|ExpenseItem");
		StructureData.Object = Object;
		StructureData.TabName = "Rates";
		FillPropertyValues(StructureData, CurData);
		
		GLAccountsInDocumentsServerCall.CheckItemRegistration(StructureData);
		FillPropertyValues(CurData, StructureData);
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetAccountingPolicyValues()
	
	AccountingPolicy = InformationRegisters.AccountingPolicy.GetAccountingPolicy(DocumentDate, Object.Company);
	Object.ManufacturingOverheadsAllocationMethod = AccountingPolicy.ManufacturingOverheadsAllocationMethod;
	
EndProcedure

&AtClient
Procedure Attachable_ProcessDateChange()
	
	SetAccountingPolicyValues();
	SetVisibleAndEnable();
	
	DocumentDate = Object.Date;
	
EndProcedure

&AtServer
Procedure SetVisibleAndEnable()
	
	AllocationMethod = Object.ManufacturingOverheadsAllocationMethod;
	
	PlantwideAllocation = (AllocationMethod = Enums.ManufacturingOverheadsAllocationMethods.PlantwideAllocation);
	DepartmentalAllocation = (AllocationMethod = Enums.ManufacturingOverheadsAllocationMethods.DepartmentalAllocation);
	ActivityBasedCosting = (AllocationMethod = Enums.ManufacturingOverheadsAllocationMethods.ActivityBasedCosting);
	
	Items.RatesActivity.Visible = ActivityBasedCosting;
	Items.RatesBusinessUnit.Visible = DepartmentalAllocation OR ActivityBasedCosting;
	
EndProcedure

#Region LibrariesHandlers

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	
	AttachableCommandsClient.ExecuteCommand(ThisObject, Command, Object);
	
EndProcedure

&AtServer
Procedure Attachable_ExecuteCommandAtServer(Context, Result)
	
	AttachableCommands.ExecuteCommand(ThisObject, Context, Object, Result);
	
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Object);
	
EndProcedure
// End StandardSubsystems.AttachableCommands

#EndRegion

#EndRegion
